---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContinuousrailEndTerminationTypeParam
source: html/8ff2c953-956c-47e7-2896-3fa4442b6df8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContinuousrailEndTerminationTypeParam Property

"End/Top Termination"

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousrailEndTerminationTypeParam { get; }
```